app/controllers/disciplines_controller.rb

  def index
    @disciplines = Discipline.all
---
SELECT "disciplines".* FROM "disciplines"

  def create
    @discipline = Discipline.new(discipline_params)

    respond_to do |format|
      if @discipline.save
---
INSERT INTO "disciplines" ("name", "duration", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "qw"], ["duration", 213], ["description", "qweqwe"], ["created_at", "2023-09-21 20:37:04.020812"], ["updated_at", "2023-09-21 20:37:04.020812"]]

    def set_discipline
      @discipline = Discipline.find(params[:id])
---
SELECT "disciplines".* FROM "disciplines" WHERE "disciplines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]