app/controllers/materials_controller.rb

        def create
          @material = @discipline.materials.new(material_params)

          if @material.save
---
INSERT INTO "materials" ("name", "description", "discipline_id", "created_at", "updated_at", "file_file_name", "file_content_type", "file_file_size", "file_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

        def set_discipline
          @discipline = Discipline.find(params[:discipline_id])
---
SELECT "disciplines".* FROM "disciplines" WHERE "disciplines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

        def set_material
          @material = @discipline.materials.find(params[:id])
---
SELECT "materials".* FROM "materials" WHERE "materials"."discipline_id" = ? AND "materials"."id" = ? LIMIT ?  [["discipline_id", 1], ["id", 1], ["LIMIT", 1]]